Dimension overconstrains the Family. Cannot set Family Type to <None>.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FamilyOverconstraint { get; }
  Visual Basic
Public Shared ReadOnly Property FamilyOverconstraint As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FamilyOverconstraint {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace